import { Router } from "express";
const siteRouters = Router();

siteRouters.get("/", (req, res) => {
    res.render("home", { description: "Моя улюблена справа — це їздити на велосипеді. Я обожнюю їздити на ньому задля відпочинку кудись чи то до парку, чи то до моря, чи то до курортного містечка поблизу мого рідного міста, хоч і теж на морі." });
});
siteRouters.get("/reasons", (req, res) => {
    res.render("reasons", { reasons: ["Відпочинок", "Спокій", "Задоволення життям", "Перезавантаження уваги" ] });
});
siteRouters.get("/opinion", (req, res) => {
    res.render("opinion", { description: "На мій погляд, щодо відпочинку поза містом проживання, це чудовий спосіб від'їхати та відсторонитися від метушні, яка є зазвичай у кожному великому місті та провести вільно час у колі своїх близьких чи друзів, чи просто наодинці з собою" });
});

export default siteRouters;